/**
 * @author Fuqiang[designsor@gmail.com]
 * @version 20110926
 */
(function(){
var area={
"北京": ["国贸","双井","三里屯","对外经贸","酒仙桥","管庄","首都机场","十八里店","北苑家园","十里堡","建外大街","大望路","朝外大街","朝阳公园/团结湖","左家庄","亮马桥/三元桥","亚运村","望京","劲松/潘家园","安贞","地安门","和平里","王府井/东单","建国门/北京站","东四","安定门","朝阳门","西四","月坛","什刹海","德外大街","西单","复兴门","阜成门","西直门/动物园","新街口","双榆树","五棵松","清河","远大路","中关村","五道口","魏公村","北太平庄","苏州桥","北下关","公主坟/万寿路","紫竹桥","航天桥","上地","颐和园","牛街","虎坊桥","菜市口","广内大街","广外大街","宣武门","广渠门","左安门","沙子口","前门","崇文门","天坛","北大地","刘家窑","青塔","开阳里","草桥","看丹桥","花乡","大红门","方庄","六里桥/丽泽桥","洋桥/木樨园","苹果园","古城/八角","鲁谷","亦庄","旧宫","黄村","西红门","新华联","梨园","新华大街","回龙观","天通苑","昌平镇"],
"上海": ["淮海路","新天地","瑞金宾馆区","打浦桥","徐家汇","万体馆","衡山路","复兴西路/丁香花园","肇嘉浜路沿线","音乐学院","龙华","漕河泾/田林","上海南站","南京西路","静安寺","曹家渡","同乐坊","虹桥","天山","古北","中山公园","上海影城/新华路","动物园/虹桥机场","北新泾","虹桥镇","虹梅路","七宝","莘庄","南方商城","春申地区","老闵行","万源城/东兰路","龙柏地区","陆家嘴","八佰伴","世纪公园","上南地区","外高桥","金桥","源深体育中心","张江","塘桥","川沙","三林镇","碧云社区","金杨地区","康桥/周浦","惠南镇","外滩","人民广场","南京东路","城隍庙","老西门","董家渡","真如","武宁地区","长寿路","长风公园/华师大","曹杨地区","梅川路","中山北路/甘泉地区","曹家渡","火车站","大宁地区","彭浦新村","闸北公园","北区汽车站","曲阳地区","鲁迅公园","四川北路","海宁路/七浦路","临平路/和平公园","北外滩","凉城/江湾镇","五角场/大学区","控江地区","中原地区","黄兴公园","平凉路","大华地区","吴淞","庙行镇","上海大学","松江镇","松江大学城","佘山","九亭","南翔","安亭","嘉定镇","江桥","朱家角"],
"广州": ["天河城/体育中心","天河北/广州东站","珠江新城/跑马场","石牌/龙口","天河公园/棠下","车陂/东圃","燕岭/五山","龙洞/岑村","沙河/天平架","北京路商业区","环市东路沿线","中山二三路/东山口","五羊新城","沿江路沿线/二沙岛","中山六路","火车站/人民北路","东风中路/越秀公园","麓湖公园周边","江南西商业区","客村/赤岗","琶洲","江南大道沿线","工业大道沿线","滨江路沿线","新港西路沿线","东晓南路沿线","上下九商业区","中山七八路","西村/西场","芳村","沙面","广园新村","三元里","新市","同德围","同和/京溪","罗冲围/金沙洲","机场路沿线","白云大道沿线","市桥","洛浦","大石","大学城","钟村","南村","石碁"],
"深圳": ["华强南","华强北","八卦岭/园岭","皇岗","梅林","中信广场","市中心区","沙头","香蜜湖","笋岗","东门商业圈","宝安南路沿线","罗湖区政府","翠竹路沿线","火车站","莲塘","南山中心区","蛇口","华侨城","南头","南油","科技园","西丽","大小梅沙","沙头角","盐田","宝安中心区","龙华镇","布吉镇","龙岗中心区"],
"南京": ["山西路/湖南路","三牌楼","南大/南师大","草场门/龙江","新街口地区","常府街/长白街","瑞金路沿线","苜蓿园","夫子庙地区","升州路/集庆路","秦虹村/中华门","珠江路沿线","紫金山/孝陵卫","火车站/玄武湖","建邺万达","莫愁湖/水西门","西站/中山码头","和燕路","东山镇/大学城","汤山镇"],
"杭州": ["西湖北线/黄龙","龙井/虎跑","高新文教区","古墩路沿线","湖滨","南山路","吴山广场/河坊街","城站火车站","武林广场","凤起路沿线","庆春路沿线","朝晖地区","湖墅南路","大关","拱宸桥/上塘","城东","下沙","城厢","北干","开发区/高教园"],
"成都": ["双楠","玉林","科华北路","桐梓林","武侯祠","高升桥","合江亭","盐市口","春熙路","书院街","牛市口","东光小区","四川师大","沙湾","茶店子","西南交大","火车站","梁家巷","抚琴","杜甫草堂","青羊宫","府南新区","人民公园","骡马市","草市街","双林路","建设路"],
"天津": ["滨江道","鞍山道沿线","和平路","南市","小白楼","五大道","西康路沿线","白堤路/风荷园","水上/天塔","老城厢","时代奥城","天拖地区","南开大学","南开公园","王顶堤/华苑","长虹公园","海光寺/六里台","梅江小区","小海地","图书大厦","永安道沿线","围堤道沿线","宾水道/体院北","尖山","工业大学","中山门","万新村","大王庄","大直沽","王串场/民权门","中山路","火车站","芥园道/邵公庄","本溪路/丁字沽","塘沽城区","经济开发区","大港油田","大港城","汉沽城区"],
"西安": ["西安交大东校区","钟楼/鼓楼","西北大/西工大","和平门/建国门","小雁塔","解放路/火车站","金花路沿线","劳动公园","汉城路沿线","莲湖公园","安定门","曲江新区","小寨/南郊大学区","电子城","未央路沿线","高新路沿线"],
"重庆": ["七星岗","解放碑","两路口","朝天门","大坪","上清寺","重庆大学","沙坪坝","小龙坎","天星桥","磁器口","歌乐山","五里店","观音桥","洋河花园","大石坝","龙溪","黄泥塝","两路南岸区南坪","南滨路","四公里","黄桷垭","杨家坪","开发区","黄桷坪","大渡口公园"],
"昆明": ["人民东路","白龙寺","金星小区","三市街","翠湖公园","北教场","丰宁小区","关上","昆明站","大观楼","滇池"],
"武汉": ["客运港/江滩","港澳台风情街","百步亭/二七","解放公园","竹叶山/后湖","阅马场","武昌火车站","武珞路","水果湖","徐东大街","江汉路步行街","西北湖","汉口火车站","武汉广场","古田路","硚口路","鹦鹉大道","汉阳大道","沌口","八大家/红钢城","余家头","光谷/鲁巷","石碑岭/街道口","吴家山"],
"郑州": ["碧沙岗","郑州大学","儿童公园","省政府","动物园/东风路","省体育场","郑东新区","二七路/火车站","郑铁体育中心","紫荆山"],
"长沙": ["德政园","马王堆","五一广场","袁家岭/火车站","天心阁/体育馆","金帆小区","望麓园","伍家岭","东塘","桂花路","三湘小区","雨花亭","桐梓坡/望月湖","岳麓山"],
"福州": ["东街口","五一广场","福州广场","省体育中心","左海/西湖公园","西禅寺","火车站","象园","岳峰镇","茶亭/工业路","台江广场","福建师大","榕城广场"],
"济南": ["大明湖","泉城广场","燕山地区","解放路","千佛山公园","济大/会展中心","青龙小区","大观园","体育中心","西市场","火车站/堤口路","北园大街","无影山","洪家楼","华龙路沿线"],
"沈阳": ["太原街","南市/马路湾","五里河/南湖公园","西塔/北市场","北站/市府","中街/故宫","奉天街沿线","文艺路/文化路","五爱市场","大东广场","大东路/东塔","东站","塔湾/小白楼","北陵","北行/辽大","滑翔小区","重工街沿线","铁西广场"],
"珠海": ["拱北","吉大","香洲","新香洲","前山","唐家湾","横琴","南屏","湾仔","井岸镇"],
"大连": ["奥林匹克广场","人民广场/新开路","胜利广场","天津街/人民路","中山广场/延安路","港湾广场","二七广场","桃源","老虎滩","西安路沿线","太原街沿线","星海湾","黑石礁","马栏子","周水子","凌水镇"],
"青岛": ["香港中路沿线","火车站/团岛","湛山/太平角","浮山所","台东","儿童公园/青岛港","海泊桥","南京路北段","麦岛大学区","石老人","李村","小村庄","海琴广场"],
"长春": ["朝阳公园/桂林路","文化广场","红旗街","南湖公园","人民广场","体育馆/文化宫","东广场","卫星广场","胜利公园","雁鸣湖","火车站","长春公园/新竹","锦江广场/电影城","东盛","东站"],
"无锡": ["中山路","火车站/上马墩","河埒口","中桥","蠡园/太湖景区","五爱广场","青石路/北大街","锡惠路","五爱路","清扬路","南禅寺","旺庄","东亭/东北塘"],
"常州": ["北大街","钟楼其他","文化宫","天宁"],
"温州": ["五马街/大南门","江滨西路","锦绣路","鹿城"],
"太原": ["柳巷商业区","火车站","迎泽公园","并州北路","龙潭商业中心","府东府西商业街","下元商业中心","漪汾街","长风街","省体育中心","高新科技产业区"],
"佛山": ["祖庙","市政府","季华园","石湾","季华六路沿线","禅城其他","大良","容桂","北滘","伦教","陈村","乐从","龙江","勒流","杏坛","均安","桂城","大沥","西樵","南海其他西南"],
"东莞": ["东纵路","花园新村","旗峰广场","中心广场","第一国际","富民步行街"],
"兰州": ["东方红广场","东岗东路","酒泉路","兰州大学","雁滩路","张掖路","安宁西路","福利路","兰州西站"],
"宁波": ["月湖公园","天一广场","鼓楼","西门口","翠柏路沿线","兴宁路","体育中心","彩虹广场","汽车东站","老外滩","大剧院","鄞奉路沿线","东钱湖"],
"苏州": ["城北","开发区","昆山其他","拙政园","观前街地区","景德路沿线","留园","石路地区","三香路沿线","虎丘景区","盘门","十全街/凤凰街","南门","木渎地区","长桥地区","吴中其他","李公堤","博览中心","左岸商业街","娄葑镇","狮山地区","枫桥地区","阳澄湖","相城其他"],
"厦门": ["中山路/轮渡","厦门大学","白鹭洲公园","莲坂/火车站","禾祥西路沿线","莲花","湖滨北路东段","湖滨北路西段","仙岳路沿线","莲前大道","环岛路沿线","鼓浪屿","江头","湖里公园","兴湖路沿线","塘边","金尚小区","东渡路","集美学村","杏林"],
"石家庄": ["红旗大街","中山西路","火车站","中山东路","世纪公园"],
"哈尔滨": ["中央大街","新阳路","爱建社区","建国公园","群力地区","江畔景区","景阳街/南极街","哈尔滨东站","秋林地区","花园街","芦家街/宣化街","文昌街","松花江街","和兴路沿线","军工院","开发区","大学城","珠江路/公滨路","三大动力路"],
"呼和浩特": ["暂无"],
"烟台": ["月亮湾","第一海水浴场","南洪街","火车站","第二海水浴场","烟台山景区","海韵广场"]
};
window.area=area;
})();
